{"class_name": "Model", "config": {"output_layers": [["conv2d_23", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 1200, 1200, 3]}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "name": "conv2d_1", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "name": "conv2d_2", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "name": "conv2d_3", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "name": "conv2d_4", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 128, "name": "conv2d_5", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 128, "name": "conv2d_6", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "conv2d_7", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "conv2d_8", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_4", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_4", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "conv2d_9", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "conv2d_10", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_5", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_5", "pool_size": [3, 3], "padding": "valid", "strides": [3, 3]}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 1024, "name": "conv2d_11", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 1024, "name": "conv2d_12", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_1", "size": [3, 3]}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": 3}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["conv2d_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "conv2d_13", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "conv2d_14", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2]}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_2", "config": {"trainable": true, "name": "concatenate_2", "axis": 3}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["conv2d_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "conv2d_15", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_16", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "conv2d_16", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_3", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_3", "size": [2, 2]}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_3", "config": {"trainable": true, "name": "concatenate_3", "axis": 3}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_17", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 128, "name": "conv2d_17", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_18", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 128, "name": "conv2d_18", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_4", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_4", "size": [2, 2]}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_4", "config": {"trainable": true, "name": "concatenate_4", "axis": 3}, "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}], ["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_19", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "name": "conv2d_19", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_20", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "name": "conv2d_20", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_5", "config": {"trainable": true, "data_format": "channels_last", "name": "up_sampling2d_5", "size": [2, 2]}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_5", "config": {"trainable": true, "name": "concatenate_5", "axis": 3}, "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}], ["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_21", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "name": "conv2d_21", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_22", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 32, "name": "conv2d_22", "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_23", "config": {"trainable": true, "data_format": "channels_last", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 3, "name": "conv2d_23", "kernel_size": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.5"}